# Arithmetic Operators

In [1]:
#Addition
3 + 5

8

In [2]:
# Subtraction 

54 - 46

8

In [3]:
# Multiplication

2 * 3

6

In [4]:
# Division

35 / 7

5.0

# Comparision Operators

In [5]:
# greater than

45 >34

True

In [6]:
# less than

56 < 23

False

In [7]:
34 * 34 < 45*23

False

In [8]:
45 == 45

True

# Logical Operators

In [9]:
# and operator

0 and 3

0

In [10]:
3 and 0

0

In [11]:
3 and 5

5

In [12]:
# or operator

0 or 3

3

In [13]:
3 or 5

3

# How variables work in Python

In [14]:
a = 5

In [15]:
print(a)

5

In [16]:
A = 4

In [18]:
print(a)
print(A)

5
4

In [20]:
a = 7
b = a
a = 3

In [21]:
print(a)

3

In [22]:
print(7)

7

# Variable naming rules

In [24]:
a = 5

In [25]:
_a =5

In [26]:
@a=5

SyntaxError: invalid syntax (759514597.py, line 1)

# Data Types

In [27]:
a =5

In [28]:
type(a)

int

In [29]:
b="abe"

In [30]:
type(b)

str

# Implementing Conditional Statements in Python

In [32]:
# Problem 1: take a variable x and print "Even" if the number is divisible by 2, otherwise print "Odd."

x=4

if(x%2==0):
    print("Even")
else:
    print("Odd")

Even

In [6]:
# Problem 2: Take a variable y and print "Grade A" if y is greater than 90, "Grade B" if y is greather than 60 but less than or equal to 90 and "Grade F" otherwise.

y=90

if(y>90):
    print("Grade A")
elif(y>60):
    print("Grade B")
else:
    print("Grade F")

Grade B

# Understanding Looping Constructs

In [4]:
# problem 1: Write a for loop to print all the numbers between 10 and 50
for i in range(11,50):
    print(i)

11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49

In [6]:
# problem 2: write a for loop to print all the odd numbers between 10 and 50

for i in range(11,50,2):
    print(i)

11
13
15
17
19
21
23
25
27
29
31
33
35
37
39
41
43
45
47
49

# Understanding Functions

In [2]:
#creating user define function

def area_circle(radius):
    area = 3.14*r*r
    return area

In [2]:
# problem: create a function that takes two numbers as argument and returns the greaer of the two

def compare(a,b):
    if(a>b):
        greater=a
    else:
        greater=b
    return greater

In [3]:
compare(10,50)

50

In [4]:
compare(14,5)

14

In [1]:
def min(a,b):
    if(a>b):
        return b
    elif (a==b):
        return 'The numbers are equal'
    else:
        return a

In [2]:
min(200,400)

200

# Creating a list

In [3]:
# creating a list

marks=[1,2,3,4,5,6,7,8,9,10]

In [4]:
marks

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [5]:
marks[5]

6

In [6]:
marks[0:6]

[1, 2, 3, 4, 5, 6]

In [7]:
# adding an element

marks.append(11)

In [8]:
marks

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11]

In [9]:
marks.extend([12,13])

In [10]:
marks

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]

In [11]:
marks.append([14,15])

In [12]:
marks

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, [14, 15]]

In [13]:
# deleting elements

marks.remove([14,15])

In [14]:
marks

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]

In [15]:
del marks[0]

In [16]:
marks

[2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]

In [17]:
# accessing list elements 
for mark in marks:
    print(mark)

2
3
4
5
6
7
8
9
10
11
12
13

In [18]:
for mark in marks:
    print(mark+1)

3
4
5
6
7
8
9
10
11
12
13
14

# Implementing Dictionaries in Python

In [19]:
# creating a dictionary

marks = {'history':45,'Geography':54,'Hindi':56}

In [20]:
marks

{'history': 45, 'Geography': 54, 'Hindi': 56}

In [21]:
# acess elements

marks["Geography"]

54

In [22]:
# adding elements

marks['english'] = 47

In [23]:
marks

{'history': 45, 'Geography': 54, 'Hindi': 56, 'english': 47}

In [24]:
marks.update({'Chemistry':89,'Physics':98})

In [25]:
marks

{'history': 45,
 'Geography': 54,
 'Hindi': 56,
 'english': 47,
 'Chemistry': 89,
 'Physics': 98}

In [26]:
# delete element

del marks['Hindi']

In [27]:
marks

{'history': 45, 'Geography': 54, 'english': 47, 'Chemistry': 89, 'Physics': 98}

# Reading csv and excel

In [45]:
# importing pandas library

import pandas as pd

In [46]:
# reading csv file

df=pd.read_csv("data.csv")

In [47]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# Reading dataframes and conduct basic operations in Python

In [48]:
# seeing the dimensions of the df dataframe

df.shape

(891, 12)

In [49]:
# top 5 rows

df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [50]:
# bottom 5 rows

df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [51]:
# seeing column names in df

df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [52]:
# select single column

df['Pclass']

0      3
1      1
2      3
3      1
4      3
      ..
886    2
887    1
888    3
889    1
890    3
Name: Pclass, Length: 891, dtype: int64

In [53]:
# selecting multiple columns

df[['Pclass', 'Cabin']]

     Pclass Cabin
0         3   NaN
1         1   C85
2         3   NaN
3         1  C123
4         3   NaN
..      ...   ...
886       2   NaN
887       1   B42
888       3   NaN
889       1  C148
890       3   NaN

[891 rows x 2 columns]

In [54]:
# select single column by name

df["Pclass"]

0      3
1      1
2      3
3      1
4      3
      ..
886    2
887    1
888    3
889    1
890    3
Name: Pclass, Length: 891, dtype: int64

In [55]:
df[['Survived', 'Embarked']]

     Survived Embarked
0           0        S
1           1        C
2           1        S
3           1        S
4           0        S
..        ...      ...
886         0        S
887         1        S
888         0        S
889         1        C
890         0        Q

[891 rows x 2 columns]

In [56]:
# selecting rows by positions

df.iloc[:5]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [57]:
# selecting columns by position

df.iloc[:,:2]

     PassengerId  Survived
0              1         0
1              2         1
2              3         1
3              4         1
4              5         0
..           ...       ...
886          887         0
887          888         1
888          889         0
889          890         1
890          891         0

[891 rows x 2 columns]

In [58]:
#subsetting data by plcass

df[df['Pclass']==1]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S
...,...,...,...,...,...,...,...,...,...,...,...,...
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [59]:
# reading csv file

df_index=pd.read_csv("index.csv")

In [60]:
df_index.head()

   A  B  C   D  E  F      G      H       I    J  K  L
0  C  A  8   0  S  0   COIL  0.700   610.0    0  0  3
1  C  R  0   0  S  0   COIL  3.200   610.0    0  0  3
2  C  R  0   0  S  0  SHEET  0.700  1300.0  762  0  3
3  C  A  0  60  ?  0   COIL  2.801   385.1    0  0  3
4  C  A  0  60  ?  0  SHEET  0.801   255.0  269  0  3

In [61]:
# access the 3rd column of the index dataframe

df_index['C']

0       8
1       0
2       0
3       0
4       0
       ..
252     0
253     6
254     0
255    45
256     6
Name: C, Length: 257, dtype: int64

In [70]:
# access last two columns of the index dataframe using iloc function

df_index.iloc[:,-2:]

     K  L
0    0  3
1    0  3
2    0  3
3    0  3
4    0  3
..  .. ..
252  0  3
253  0  3
254  0  3
255  0  3
256  0  3

[257 rows x 2 columns]

In [74]:
#access last 10 rows and first two columns

df_index.iloc[-10:, 0:2]

     A  B
247  C  R
248  C  A
249  C  A
250  C  R
251  C  A
252  C  A
253  C  R
254  C  A
255  C  K
256  C  R